zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_SILS_Bits.WSTL */
#define IFX_ERAY_SILS_WSTL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.WSTL */
#define IFX_ERAY_SILS_WSTL_OFF (0u)

/** \brief Length for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_OFF (1u)

/** \brief Length for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_OFF (2u)

/** \brief Length for Ifx_ERAY_SILS_Bits.TXIL */
#define IFX_ERAY_SILS_TXIL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.TXIL */
#define IFX_ERAY_SILS_TXIL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.TXIL */
#define IFX_ERAY_SILS_TXIL_OFF (3u)

/** \brief Length for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_OFF (4u)

/** \brief Length for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_OFF (5u)

/** \brief Length for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_OFF (6u)

/** \brief Length for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_OFF (7u)

/** \brief Length for Ifx_ERAY_SILS_Bits.TI0L */
#define IFX_ERAY_SILS_TI0L_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.TI0L */
#define IFX_ERAY_SILS_TI0L_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.TI0L */
#define IFX_ERAY_SILS_TI0L_OFF (8u)

/** \brief Length for Ifx_ERAY_SILS_Bits.TI1L */
#define IFX_ERAY_SILS_TI1L_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.TI1L */
#define IFX_ERAY_SILS_TI1L_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.TI1L */
#define IFX_ERAY_SILS_TI1L_OFF (9u)

/** \brief Length for Ifx_ERAY_SILS_Bits.TIBCL */
#define IFX_ERAY_SILS_TIBCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.TIBCL */
#define IFX_ERAY_SILS_TIBCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.TIBCL */
#define IFX_ERAY_SILS_TIBCL_OFF (10u)

/** \brief Length for Ifx_ERAY_SILS_Bits.TOBCL */
#define IFX_ERAY_SILS_TOBCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.TOBCL */
#define IFX_ERAY_SILS_TOBCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.TOBCL */
#define IFX_ERAY_SILS_TOBCL_OFF (11u)

/** \brief Length for Ifx_ERAY_SILS_Bits.SWEL */
#define IFX_ERAY_SILS_SWEL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.SWEL */
#define IFX_ERAY_SILS_SWEL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.SWEL */
#define IFX_ERAY_SILS_SWEL_OFF (12u)

/** \brief Length for Ifx_ERAY_SILS_Bits.SUCSL */
#define IFX_ERAY_SILS_SUCSL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.SUCSL */
#define IFX_ERAY_SILS_SUCSL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.SUCSL */
#define IFX_ERAY_SILS_SUCSL_OFF (13u)

/** \brief Length for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_OFF (14u)

/** \brief Length for Ifx_ERAY_SILS_Bits.SDSL */
#define IFX_ERAY_SILS_SDSL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.SDSL */
#define IFX_ERAY_SILS_SDSL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.SDSL */
#define IFX_ERAY_SILS_SDSL_OFF (15u)

/** \brief Length for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_OFF (16u)

/** \brief Length for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_OFF (17u)

/** \brief Length for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_OFF (24u)

/** \brief Length for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_OFF (25u)

/** \brief Length for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_OFF (0u)

/** \brief Length for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_OFF (1u)

/** \brief Length for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_OFF (2u)

/** \brief Length for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_LEN (1u)

